Repository: ECEspecialist/test-east-telecom
Catalog: quiz_project/quiz_app/locale/*/LC_MESSAGES/django.po
Languages: uz

source: Department Name
uz: Bo‘lim nomi

source: Test Title
uz: Test nomi

source: Department
uz: Bo‘lim

source: Quiz Set
uz: Test to‘plami

source: Question Text
uz: Savol matni

source: Question
uz: Savol

source: Choice Text
uz: Variant matni

source: Is Correct
uz: To‘g‘ri

source: Quiz
uz: Test

source: Score
uz: Ball

source: Total Questions
uz: Jami savollar

source: Time Taken
uz: Sarflangan vaqt

source: Start Time
uz: Boshlanish vaqti

source: End Time
uz: Tugash vaqti

source: Created At
uz: Yaratilgan vaqt

source: PDF File
uz: PDF fayl

source: Status
uz: Holat

source: Pass
uz: O‘tgan

source: Fail
uz: Yiqilgan

source: Dashboard
uz: Boshqaruv paneli

source: Network team
uz: Tarmoq jamoasi

source: Facility team
uz: Qurilish jamoasi

source: Welcome
uz: Xush kelibsiz

source: English
uz: Inglizcha

source: Uzbek
uz: O‘zbekcha

source: Russian
uz: Ruscha

source: Logout
uz: Chiqish

source: Change language
uz: Tilni o'zgartirish

source: Welcome to the Test Dashboard
uz: Test boshqaruv paneliga xush kelibsiz

source: Dashboard - Test Results
uz: Boshqaruv paneli - Test natijalari

source: Select a department from the sidebar to begin.
uz: Boshlash uchun yon paneldan bo‘limni tanlang.

source: Timestamp
uz: Vaqt belgisi

source: Download PDF
uz: PDF-ni yuklab olish

source: No PDF available yet.
uz: Hozircha PDF mavjud emas.

source: Test Sets
uz: Test to‘plamlari

source: No tests available for this department.
uz: Bu bo‘lim uchun testlar mavjud emas.

source: No test results found.
uz: Hech qanday test natijalari topilmadi.

source: Login
uz: Kirish

source: Sign up
uz: Ro‘yxatdan o‘tish

source: Do not have an account?
uz: Hisobingiz yo‘qmi?

source: Create Account
uz: Hisob yaratish

source: Already have an account?
uz: Hisobingiz bormi?

source: Login here
uz: Bu yerda kiring

source: Platform Info
uz: Platforma haqida

source: How the Platform Works
uz: Platforma qanday ishlaydi

source: Overview
uz: Umumiy ma'lumot

source: This system allows departments to manage test sets...
uz: Ushbu tizim bo‘limlarga test to‘plamlarini boshqarish imkonini beradi...

source: User Roles
uz: Foydalanuvchi rollari

source: Admin/Staff
uz: Admin/xodim

source: Can create departments and tests
uz: Bo‘limlar va testlar yaratishi mumkin

source: User
uz: Foydalanuvchi

source: Can take tests and download results
uz: Testlarni bajarishi va natijalarni yuklab olishi mumkin

source: Workflow
uz: Ish jarayoni

source: Admin creates departments
uz: Admin bo‘limlar yaratadi

source: Admin creates test sets and questions
uz: Admin testlar va savollar yaratadi

source: Users take tests by department
uz: Foydalanuvchilar bo‘limlar bo‘yicha testlarni topshiradi

source: System calculates score and generates PDF
uz: Tizim ballarni hisoblaydi va PDF hosil qiladi

source: Multi-language Support
uz: Ko‘p tilli qo‘llab-quvvatlash

source: The interface is available in English, Uzbek, and Russian.
uz: Interfeys ingliz, o‘zbek va rus tillarida mavjud.

source: PDF Results
uz: PDF natijalar

source: PDF files include detailed test result information with timestamps.
uz: PDF fayllar vaqt belgilari bilan test natijalarining batafsil ma'lumotlarini o‘z ichiga oladi.

source: Test Result
uz: Test natijasi

source: Your score
uz: Sizning ballingiz

source: Back to Dashboard
uz: Boshqaruv paneliga qaytish

source: Finish
uz: Tugatish

source: Next
uz: Keyingi

source: Waiting for evaluation
uz: Baholashni kutmoqda

source: Waiting for PDF
uz: PDF tayyorlanishini kutmoqda

source: Generate PDF
uz: PDF yaratish

source: Pending
uz: Kutilmoqda

source: Grade first
uz: Avval baholang

source: Grade
uz: Baho

source: Written
uz: Yozma

source: MCQ
uz: Test

source: Grade Written Answers
uz: Yozma javoblarni baholang

source: Student Answer
uz: Talabaning javobi

source: Grade (0-100)
uz: Baho (0-100)

source: Save Grades
uz: Baholarni saqlash

source: Not Graded
uz: Baholanmagan

source: MCQ Test Result
uz: Test natijasi (variant tanlash)

source: Correct Answers
uz: To'g'ri javoblar

source: MCQ Percentage
uz: To'g'rilik foizi

source: Written Test Result
uz: Yozma test natijasi

source: Your Written Test Score
uz: Sizning yozma test natijangiz

source: Written test not graded yet.
uz: Yozma test hali baholanmagan.

source: No written test submitted.
uz: Yozma test topshirilmagan.
